create_clock -period 10.000 -name GCLK -waveform {0.000 5.000} [get_ports GCLK]
create_clock -period 100.000 -name VIRTUAL_clk_out1_clock_gen -waveform {0.000 50.000}
set_input_delay -clock [get_clocks GCLK] -min -add_delay 4.000 [get_ports BTND]
set_input_delay -clock [get_clocks GCLK] -max -add_delay 6.000 [get_ports BTND]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay 40.000 [get_ports SW0]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 60.000 [get_ports SW0]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay 40.000 [get_ports SW1]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 60.000 [get_ports SW1]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay 40.000 [get_ports SW2]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 60.000 [get_ports SW2]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay 40.000 [get_ports SW3]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 60.000 [get_ports SW3]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay 40.000 [get_ports SW4]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 60.000 [get_ports SW4]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay 40.000 [get_ports SW5]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 60.000 [get_ports SW5]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay 40.000 [get_ports SW6]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 60.000 [get_ports SW6]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay 40.000 [get_ports SW7]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 60.000 [get_ports SW7]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay -10.000 [get_ports LD0]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 30.000 [get_ports LD0]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -min -add_delay -10.000 [get_ports LD2]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_clock_gen] -max -add_delay 30.000 [get_ports LD2]
